Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/the_irish_education_system/overview_of_the_irish_education_system.html.txt.tmx
Source language: en
Languages: ga

source: Overview of the Irish education system
ga: Forléargas ar chóras oideachais na hÉireann

source: Education is compulsory for children in Ireland from the ages of six to 16 or until students have completed three years of second-level education
ga: Tá oideachas éigeantach do leanaí in Éirinn ó aoiseanna a sé go 16 nó go dtí go bhfuil trí bliana d'oideachas dara leibhéal comhlánaithe ag mic léinn

source: The Irish education system is made up of primary, second, third-level and further education
ga: Tá córas oideachais na hÉireann déanta suas den bhunscolaíocht, dara leibhéal, tríú leibhéal agus breisoideachas

source: State-funded education is available at all levels, unless you choose to send your child to a private institution
ga: Tá oideachas atá maoinithe ag an Stát ar fáil ag gach leibhéal, mura roghnaíonn tú do leanbh a chur chuig institiúid phríobháideach

source: The Early Childhood Care and Education (ECCE) Scheme provides a free year of early childhood care and education for children of pre-school age
ga: Is gnách gur áiseanna nó soláthraithe cúram leanaí atá maoinithe go príobháideach a sholáthraíonn oideachas réamhscolaíochta

source: Some pre-school initiatives focused on children at risk are funded by the Department of Education and Skills
ga: Tá tionscnaimh áirithe a dhíríonn ar leanaí i bpriacal atá maoinithe ag an Roinn Oideachais agus Scileanna

source: Children do not have to attend school until the age of six but it is usual for children to begin school the September following their fourth birthday
ga: Ní gá do leanaí freastal a dhéanamh ar an scoil go dtí aois a sé, ach is iondúil do leanaí an scoil a thosú i Meán Fómhair tar éis dóibh an ceathrú lá breithe a shlánú

source: Four-year-olds and five-year-olds are enrolled in the junior or senior infant classes
ga: Tá leanaí ceithre bliana agus cúig bliana rollaithe i ranganna na naíonán beag agus mór

source: The curriculum for primary education covers the following key areas:
ga: Clúdaíonn curaclam na bunscoile na réimsí tábhachtacha a leanas:

source: Language, mathematics, social, environment and scientific education, arts education including visual arts music and drama, physical integration, social personal and health education
ga: Teanga, matamaitic, oideachas sóisialta, comhshaoil agus eolaíochta, oideachas ealaíon a chuimsíonn na hamharcealaíona, ceol agus drámaíocht, comtháthú fisiciúil, oideachas sóisialta, pearsanta agus sláinte

source: Primary schools are generally privately owned by religious communities (or boards of governors) but are State-funded
ga: Tá bunscoileanna faoi úinéireacht phríobháideach go ginearálta ag pobail eaglasta (nó boird ghobharnóirí) ach tá siad maoinithe ag an Stát

source: Second-level education is provided by different types of post-primary schools
ga: Tá oideachas dara leibhéal soláthraithe ag cineálacha éagsúla iarbhunscoileanna

source: That is, secondary, vocational, community and comprehensive schools
ga: Is iad sin, meánscoileanna, gairmscoileanna, pobalscoileanna agus scoileanna cuimsitheacha

source: Secondary schools are privately owned and managed
ga: Tá meánscoileanna bainistithe go príobháideach agus faoi úinéireacht phríobháideach

source: In most cases the trustees are religious communities or boards of governors
ga: I mbeagnach gach cás, is iad pobail eaglasta nó boird ghobharnóirí iad na hiontaobhaithe

source: Vocational schools are established by the State and administered by vocational education committees
ga: Is é an Stát a bhunaíonn gairmscoileanna agus bíonn siad riartha ag coistí gairmoideachais

source: Community and comprehensive schools are managed by boards of management of differing compositions
ga: Tá pobalscoileanna agus scoileanna cuimsitheacha á mbainistiú ag boird bhainistíochta de bhallraíochtaí éagsúla

source: Second-level education consists of a three-year junior cycle followed by a two-year or three-year senior cycle depending on whether an optional Transition Year is taken following the Junior Certificate examination
ga: Cuimsíonn oideachas dara leibhéal sraith shóisearach trí bliana agus sraith shinsearach dhá bhliain nó trí bliana ag brath ar cibé an dtógtar nó nach dtógtar an Idirbhliain roghnach tar éis scrúdú an Teastais Shóisearaigh

source: Students generally commence the junior cycle at the age of 12
ga: Tosaíonn mic léinn ar an tsraith shóisearach ag aois 12 de ghnáth

source: The Junior Certificate is taken after three years
ga: Suítear an Teastas Sóisearach tar éis trí bliana

source: Transition Year follows the Junior Certificate examination
ga: Leanann an Idirbhliain scrúdú an Teastais Shóisearaigh

source: This year is free from formal examinations and allows students to experience a wide range of educational inputs, including work experience
ga: Tá an bhliain seo saor ó scrúduithe foirmeálta agus ceadaítear do mhic léinn taithí a fháil ar réimse leathan d'ionchuir oideachasúla, taithí oibre san áireamh

source: During their final two years in the senior cycle, students take one of three programmes, each leading to a State examination - the established Leaving Certificate, the Leaving Certificate Vocational Programme or the Leaving Certificate Applied
ga: Le linn an dá bhliain deiridh den tsraith shinsearach, tógann mic léinn ceann amháin de thrí chlár, gach ceann acu a chríochnaíonn le scrúdú Stáit - an Ardteistiméireacht bhunaithe, Gairmchlár na hArdteistiméireachta nó an Ardteistiméireacht Fheidhmeach

source: The established Leaving Certificate is the main basis upon which places in universities, institutes of technology and colleges of education are allocated
ga: Is í an Ard-Teistiméireacht bhunaithe an príomhbhunús ar a ndáiltear áiteanna in ollscoileanna, institiúidí teicneolaíochta agus coláistí oideachais

source: The Leaving Certificate Vocational Programme differs from the established Leaving Certificate in placing a concentration on technical subjects and including additional modules which have a vocational focus
ga: Tá Gairmchlár na hArdteistiméireachta difriúil ón Ardteistiméireacht bhunaithe sa mhéid agus go ndírítear ar ábhair theicniúla agus modúil bhreise le fócas gairme acu

source: The Leaving Certificate Applied Programme has as its primary objective the preparation of participants for adult and working life through relevant learning experiences
ga: Tá sé mar phríomhchuspóir ag an Ardteistiméireacht Fheidhmeach na rannpháirtithe a ullmhú don saol oibre agus saol an aosaigh trí thaithí foghlama ábhartha

source: These aim to develop the following areas of human endeavour: spiritual, intellectual, social, emotional, aesthetic and physical
ga: Tá sé mar chuspóir acu seo na réimsí a leanas i gcomhdhéanamh an duine a fhorbairt: spioradálta, intleachtúil, sóisialta, mothúchánach, aeistéitiúil agus fisiciúil

source: The Leaving Certificate Applied is not recognised for direct entry to third-level courses but it can enable students to take Post-Leaving Certificate courses
ga: Níl an Ardteistiméireacht Fheidhmeach aitheanta d'iontráil dhíreach go dtí cúrsaí tríú leibhéal, ach is féidir a chur ar chumas mic léinn cúrsaí iar-Ardteistiméireachta a thógáil

source: Third-level education is made up of a number of sectors
ga: Tá oideachas tríú leibhéal déanta suas de roinnt rannóg

source: The university sector, the technological sector and the colleges of education are substantially funded by the State
ga: Tá maoiniú substaintiúil ón Stát ag rannóg na n-ollscoileanna, rannóg na teicneolaíochta agus ag na coláistí oideachais

source: In addition there are a number of independent private colleges
ga: Ina theannta sin, tá líon áirithe coláistí neamhspleácha atá príobháideach

source: There are seven universities, which are autonomous and self-governing
ga: Tá seacht n-ollscoil ann agus tá siad uathrialach agus féinrialaitheach

source: They offer degree programmes at bachelor, masters and doctorate level
ga: Déanann siad cláir chéime a thairiscint ag leibhéal baitsiléara, máistreachta agus dochtúireachta

source: The technological sector includes institutes of technology which provide programmes of education and training in areas such as business, science, engineering, linguistics and music to certificate, diploma and degree levels
ga: Cuimsíonn rannóg na teicneolaíochta institiúidí teicneolaíochta a sholáthraíonn cláir oideachais agus oiliúna i réimsí cosúil le gnó, eolaíocht, innealtóireacht, teangeolaíocht agus ceol go leibhéal teastais, dioplóma agus céime

source: The Department of Education and Skills has overall responsibility for the sector
ga: Tá freagracht fhoriomlán ar an Roinn Oideachais agus Scileanna don rannóg

source: The colleges of education specialise in training for first-level teachers
ga: Déanann coláistí oideachais speisialú in oiliúint do mhúinteoirí céadleibhéil

source: They offer a three-year bachelor of education degree and a postgraduate diploma
ga: Déanann siad céim trí bliana don Bhaitsiléir san Oideachas agus dioplóma iarchéime 18 mí a thairiscint

source: The training of second-level teachers usually involves completing a primary degree in university or other third-level institution followed by a one-year higher diploma in education
ga: Go hiondúil, maidir le hoiliúint na múinteoirí dara leibhéal, caithfidh bunchéim a bheith comhlánaithe acu in ollscoil nó institiúid tríú leibhéal eile, agus ard-dioplóma bliana san oideachas ina dhiaidh sin

source: In addition, there are colleges of education that specialise in the training of second-level home economics teachers, teachers of religion and physical education
ga: Ina theannta sin, tá coláistí oideachais ann a dhéanann speisialú in oiliúint do mhúinteoirí dara leibhéal san eacnamaíocht bhaile, sa reiligiún agus sa chorpoideachas

source: Further and adult education
ga: Breisoideachas agus oideachas aosach

source: Further education comprises education and training which takes place after second-level schooling but which is not part of the third-level system
ga: Cuimsíonn breisoideachas oideachas agus oiliúint a tharlaíonn tar éis na scolaíochta dara leibhéal, ach nach bhfuil mar chuid den chóras tríú leibhéal

source: It includes programmes such as Post-Leaving Certificate courses; the Vocational Training Opportunities Scheme (second-chance education for the unemployed); programmes in Youthreach for early school-leavers; other literacy and basic education; and self-funded evening adult programmes in second-level schools
ga: Cuimsíonn sé cláir cosúil le cúrsaí iar-Ardteistiméireachta; an Scéim Deiseanna Oiliúna Gairmoideachais (oideachas athdheise do dhaoine dífhostaithe); cláir in Ógtheagmháil do luathfhágálaithe scoile; oideachas bunúsach agus litearthachta; agus cláir um thráthnóna d'aosaigh i scoileanna dara leibhéal

source: Special needs education for students with disabilities
ga: Oideachas riachtanais speisialta do mhic léinn atá faoi mhíchumas

source: Educational provision for students with special educational needs ranges from additional support in mainstream schools to specialist support in special schools
ga: Réimsíonn soláthar oideachasúil do mhic léinn le riachtanais speisialta oideachais ó thacaíocht bhreise sna scoileanna príomhshrutha go tacaíocht speisialaithe sna scoileanna speisialta

source: A student with a disability may be enrolled in a:
ga: Is féidir mac léinn atá faoi mhíchumas a chlárú i:

source: • Mainstream class with additional support
ga: • Rang príomhshrutha le tacaíocht bhreise

source: • Special class in a mainstream school or
ga: • Rang speisialta i scoil príomhshrutha nó

source: • Special school which caters for the students with his or her category of disability
ga: • Scoil speisialta a fhreastalaíonn ar mhic léinn lena c(h)atagóir mhíchumais
